app/Http/Controllers/Backend/AttributeController.php

    public function index()
    {
        $this->_data['items'] = Attribute::where('type',$this->_data['type'])->orderBy('priority', 'asc')->paginate(25);
---
select * from `attributes` where `type` = 'color' order by `priority` asc limit 25 offset 0
select count(*) as aggregate from `attributes` where `type` = 'color'

    public function create()
    {
        $this->_data['priority'] = Attribute::where('type',$this->_data['type'])->max('priority');
---
select max(`priority`) as aggregate from `attributes` where `type` = 'color'