app/Http/Controllers/Backend/CategoryController.php

    public function index()
    {
        $this->_data['items'] = Category::with(['languages' => function ($query) {
                $query->where('language', $this->_data['language']);
            }])->where('type',$this->_data['type'])->orderBy('priority', 'asc')->get()->toTree();
---
select max(`priority`) as aggregate from `categories` where `type` = 'san-pham'
select * from `categories` where `type` = 'san-pham' order by `priority` asc

    public function create()
    {
        $this->_data['priority'] = Category::where('type',$this->_data['type'])->max('priority');
        $this->_data['categories'] = Category::with(['languages' => function ($query) {
                $query->where('language', $this->_data['language']);
            }])->where('type',$this->_data['type'])->orderBy('priority', 'asc')->get()->toTree();
---
select * from `categories` where `type` = 'san-pham' order by `priority` desc
select max(`priority`) as aggregate from `categories` where `type` = 'san-pham'
select * from `categories` where `type` = 'san-pham' order by `priority` asc

    public function edit(Category $category)
    {
        $this->_data['categories'] = Category::where('id','!=',$category->id)->with(['languages' => function ($query) {
                $query->where('language', $this->_data['language']);
            }])->where('type',$this->_data['type'])->orderBy('priority', 'asc')->get()->toTree();
---
select * from `categories` where `id` != '1' and `type` = 'san-pham' order by `priority` asc

            $dataInsert = [];
            $i = 0;
            foreach(config('siteconfigs.languages') as $lang => $val){
                $categoryL = CategoryLanguage::find($category->languages[$i]['id']);
---
select * from `category_languages` where `category_languages`.`category_id` = '1' and `category_languages`.`category_id` is not null order by `id` asc

    public function remove(Request $request, $id){
        if($request->ajax()){
            $category = Category::findOrFail($id);
            delete_image($this->_data['path'].'/'.$category->image,$this->_data['config']['thumbs']);
            $category->update(['image'=>'']);
---
update `categories` set `image` = '', `updated_at` = '2018-10-18 09:01:09' where `id` = '1'