app/Http/Controllers/Backend/CategoryController.php

update `categories` set `_lft` = '1', `_rgt` = '2', `updated_at` = '2018-10-17 07:42:21' where `id` = '1'
---
    public function priority(Request $request){
        $id = $request->id;
        $category = Category::findOrFail($id);

        $up = $request->priority;
        $curr = $category->priority;
        $max = Category::where('type',$category->type)->max('priority');
        if($up > $max){
            $up = $max;
        }
        if( $up > $curr ){
            Category::where('type',$category->type)->whereBetween('priority', [$curr+1, $up])->decrement('priority');