app/Http/Controllers/Backend/ProductController.php

select * from `products` where `type` = 'san-pham' order by `priority` asc limit 25 offset 0
select count(*) as aggregate from `products` where `type` = 'san-pham'
---
    public function index()
    {
        $this->_data['items'] = Product::where('type',$this->_data['type'])->orderBy('priority', 'asc')->paginate(25);

select max(`priority`) as aggregate from `products` where `type` = 'san-pham'
select max(`priority`) as aggregate from `categories` where `type` = 'san-pham'
select * from `categories` where `type` = 'san-pham' order by `priority` asc
select `id`, `name` from `suppliers` where `type` = 'default' order by `priority` asc
---
    public function create()
    {
        $this->_data['priority'] = Product::where('type',$this->_data['type'])->max('priority');
        $this->_data['categories'] = Category::where('type',$this->_data['type'])->orderBy('priority', 'asc')->get()->toTree();
        $this->_data['suppliers'] = Supplier::select('id','name')->where('type','default')->orderBy('priority', 'asc')->get();

select max(`priority`) as aggregate from `products` where `type` = 'san-pham'
---
            $product->sale_price      = floatval(str_replace('.', '', $request->input('sale_price')));
            $product->weight          = floatval(str_replace('.', '', $request->input('weight')));

            $product->priority   = Product::where('type',$this->_data['type'])->max('priority')+1;

select * from `categories` where `type` = 'san-pham' order by `priority` asc
select `id`, `name` from `suppliers` where `type` = 'default' order by `priority` asc
select * from `media_libraries` where `id` in ('1', '2', '3') order by `id` asc
---
    public function edit(Product $product)
    {
        $this->_data['categories'] = Category::where('type',$this->_data['type'])->orderBy('priority', 'asc')->get()->toTree();
        $this->_data['suppliers'] = Supplier::select('id','name')->where('type','default')->orderBy('priority', 'asc')->get();
        $this->_data['images'] = $product->attachments ? MediaLibrary::whereIn('id', explode(',',$product->attachments) )->orderBy('id', 'asc')->get() : [];

select * from `product_languages` where `product_languages`.`product_id` = '1' and `product_languages`.`product_id` is not null order by `id` asc
---
            $dataInsert = [];
            $i = 0;
            foreach(config('siteconfigs.languages') as $lang => $val){
                $productL = ProductLanguage::find($product->languages[$i]['id']);

update `products` set `updated_at` = '2018-11-17 03:29:47' where `id` = '2'
---
    public function destroy(Request $request, Product $product)
    {
        if($request->ajax()){
            if($product->delete()){
                $thumbs = config('siteconfigs.product.'.$product->type.'.thumbs');
                delete_image($this->_data['path'].'/'.$product->image,$thumbs);
                if( $product->attachments ){
                    $arrID = explode(',',$product->attachments);
                    $medias = MediaLibrary::whereIn('id',$arrID)->get();
                    if( $medias !== null ){
                        foreach( $medias as $media ){
                            delete_image($this->_data['path'].'/'.$media->name,$thumbs);
                        }
                        MediaLibrary::destroy($arrID);
                    }
                }
                Product::where('type',$product->type)->where('priority', '>', $product->priority)->decrement('priority');

select `id`, `status` from `products` where `id` in ('1')
update `products` set `status` = '', `updated_at` = '2018-11-19 07:20:18' where `id` = '1'
---
    public function status(Request $request){
        if($request->ajax()){
            $arrID = explode(',',$request->id);
            $products = Product::select('id','status')->whereIn('id',$arrID)->get();
            if( $products ){
                foreach( $products as $product ){
                    $status = explode(',',$product->status);
                    $key = array_search($request->status, $status);
                    if( $key !== false ){
                        unset($status[$key]);
                    }else{
                        $status[] = $request->status;
                    }
                    $product->status = $status ? implode(',',$status) : '';
                    $product->save();