app/Http/Controllers/Backend/SupplierController.php

    public function index()
    {
        $this->_data['items'] = Supplier::where('type',$this->_data['type'])->orderBy('priority', 'asc')->paginate(25);
---
select count(*) as aggregate from `suppliers` where `type` = 'default'

    public function destroy(Request $request, Supplier $supplier)
    {
        if($request->ajax()){
            if($supplier->delete()){
                Supplier::where('type',$supplier->type)->where('priority', '>', $supplier->priority)->decrement('priority');
---
update `suppliers` set `updated_at` = '2018-10-17 03:25:14' where `id` = '1'