app/Http/Controllers/Backend/UserController.php

select count(*) as aggregate from `users` where `type` = 'mod'
---
    public function index()
    {
        $this->_data['items'] = User::where('type',$this->_data['type'])->orderBy('priority', 'asc')->paginate(25);

select max(`priority`) as aggregate from `users` where `type` = 'mod'
---
    public function create()
    {
        $this->_data['priority'] = User::where('type',$this->_data['type'])->max('priority');